docs: format and cleanup
